tinko26/ao/ao_sys_xc32_pic32mz_ec/ao_ir_sqi.h
// ----------------------------------------------------------------------------

// MIT License

// Copyright (c) 2022 Stefan Wagner

// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.

// ----------------------------------------------------------------------------

// SQI interrupt.

// ----------------------------------------------------------------------------

#include <stdbool.h>
#include <sys/attribs.h>
#include <xc.h>

// ----------------------------------------------------------------------------

#ifndef AO_IR_SQI1_ATTRIBUTE

#define AO_IR_SQI1_ATTRIBUTE        __ISR(_SQI1_VECTOR, IPL4SRS)

#endif

#ifndef AO_IR_SQI1_PRIO

#define AO_IR_SQI1_PRIO             (4)

#endif

#ifndef AO_IR_SQI1_SUBPRIO

#define AO_IR_SQI1_SUBPRIO          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_sqi1_disable

#define ao_ir_sqi1_disable()        { IEC5CLR = _IEC5_SQI1IE_MASK; }

#endif

#ifndef ao_ir_sqi1_enable

#define ao_ir_sqi1_enable()         { IEC5SET = _IEC5_SQI1IE_MASK; }

#endif

#ifndef ao_ir_sqi1_is_enabled

#define ao_ir_sqi1_is_enabled()     ((IEC5 & _IEC5_SQI1IE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_sqi1_is_pending

#define ao_ir_sqi1_is_pending()     ((IFS5 & _IFS5_SQI1IF_MASK) ? true : false)

#endif

#ifndef ao_ir_sqi1_reply

#define ao_ir_sqi1_reply()          { IFS5CLR = _IFS5_SQI1IF_MASK; }

#endif

#ifndef ao_ir_sqi1_request

#define ao_ir_sqi1_request()        { IFS5SET = _IFS5_SQI1IF_MASK; }

#endif

// ----------------------------------------------------------------------------
